EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаПодборПерсонала/ЗаявкаНаПодборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодборПерсонала</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРассмотрел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаПодборПерсонала/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.СогласованиеВакансий

// См. СогласованиеВакансий.ЗаполнитьДанныеСогласованияВакансии
Процедура ЗаполнитьДанныеСогласованияВакансии(ОбъектСогласования, ДанныеСогласования, ТребуетсяСогласование) Экспорт
	
	ЗаполнитьЗначенияСвойств(ДанныеСогласования, ОбъектСогласования);
	ДанныеСогласования.Вакансия = ОбъектСогласования.Ссылка;
	
	ДанныеСогласования.СостояниеСогласования = Неопределено;
	Если ОбъектСогласования.Проведен Тогда
		ДанныеСогласования.СостояниеСогласования = Перечисления.СостоянияСогласования.Рассматривается;
	КонецЕсли;
	
КонецПроцедуры

// См. СогласованиеВакансий.ПриУстановкеСостоянияСогласованияВакансии
Процедура ПриУстановкеСостоянияСогласованияВакансии(ОбъектСогласования, ДанныеСогласования) Экспорт
	
КонецПроцедуры

// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.СогласованиеВакансий

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция-конструктор для составления параметра к методу ДанныеЗаявкиНаПодборПерсонала.
// 
// Возвращаемое значение:
//  Структура - структура с полями, описывающих требования к получению данных заявки.
//
Функция ПараметрыПолученияДанныхЗаявки() Экспорт
	
	ПараметрыПолучения = Новый Структура(
		"ХарактеристикиПерсонала,
		|ДействияСотрудников,
		|Согласование");
	
	ПараметрыПолучения.ХарактеристикиПерсонала = Ложь;
	ПараметрыПолучения.ДействияСотрудников = Ложь;
	ПараметрыПолучения.Согласование = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью") Тогда
		ПараметрыПолучения.ХарактеристикиПерсонала = Истина;
		ПараметрыПолучения.ДействияСотрудников = Истина;
	КонецЕсли;
	
	Возврат ПараметрыПолучения;
	
КонецФункции

// Формирует структуру с данными документа по его ссылке.
//
// Параметры:
//  ЗаявкаНаПодборПерсонала	 - ДокументСсылка.ЗаявкаНаПодборПерсонала	 - заявка, данные которой необходимо получить.
//  ПараметрыПолучения		 - Структура								 - необязательный, см. ПараметрыПолученияДанныхЗаявки.
// 
// Возвращаемое значение:
//  Структура - структура с полями:
//  Ссылка,
//  Позиция,
//  НоваяПозиция,
//  Подразделение,
//  Должность,
//  ПрофильДолжности,
//  Требования,
//  Обязанности,
//  Условия,
//  ПредполагаемыйДоход,
//  ПланируемаяДатаЗакрытия,
//  Приоритет,
//  ПричинаОткрытия,
//  СпособНабора,
//  НазначениеНабора,
//  Ответственный,
//  Комментарий
//
Функция ДанныеЗаявкиНаПодборПерсонала(ЗаявкаНаПодборПерсонала, ПараметрыПолучения = Неопределено) Экспорт
	
	Если ПараметрыПолучения = Неопределено Тогда
		ПараметрыПолучения = ПараметрыПолученияДанныхЗаявки();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаявкаНаПодборПерсонала", ЗаявкаНаПодборПерсонала);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаПодборПерсонала.Ссылка КАК Ссылка,
		|	ЗаявкаНаПодборПерсонала.Позиция КАК Позиция,
		|	ЗаявкаНаПодборПерсонала.НоваяПозиция КАК НоваяПозиция,
		|	ЗаявкаНаПодборПерсонала.Подразделение КАК Подразделение,
		|	ЗаявкаНаПодборПерсонала.Должность КАК Должность,
		|	ЗаявкаНаПодборПерсонала.ПрофильДолжности КАК ПрофильДолжности,
		|	ЗаявкаНаПодборПерсонала.Требования КАК Требования,
		|	ЗаявкаНаПодборПерсонала.Обязанности КАК Обязанности,
		|	ЗаявкаНаПодборПерсонала.Условия КАК Условия,
		|	ЗаявкаНаПодборПерсонала.ПредполагаемыйДоход КАК ПредполагаемыйДоход,
		|	ЗаявкаНаПодборПерсонала.ПланируемаяДатаЗакрытия КАК ПланируемаяДатаЗакрытия,
		|	ЗаявкаНаПодборПерсонала.Приоритет КАК Приоритет,
		|	ЗаявкаНаПодборПерсонала.ПричинаОткрытия КАК ПричинаОткрытия,
		|	ЗаявкаНаПодборПерсонала.СпособНабора КАК СпособНабора,
		|	ЗаявкаНаПодборПерсонала.НазначениеНабора КАК НазначениеНабора,
		|	ЗаявкаНаПодборПерсонала.Ответственный КАК Ответственный,
		|	ЗаявкаНаПодборПерсонала.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЗаявкаНаПодборПерсонала КАК ЗаявкаНаПодборПерсонала
		|ГДЕ
		|	ЗаявкаНаПодборПерсонала.Ссылка = &ЗаявкаНаПодборПерсонала";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	
	Если ПараметрыПолучения.ХарактеристикиПерсонала Тогда
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ХарактеристикиПерсонала.Характеристика");
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ХарактеристикиПерсонала.Значение");
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ХарактеристикиПерсонала.Вес");
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ХарактеристикиПерсонала.ТребуетсяПроверка");
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ХарактеристикиПерсонала.ТребуетсяОбучение");
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ХарактеристикиПерсонала.ВесЗначения");
	КонецЕсли;
	
	Если ПараметрыПолучения.ДействияСотрудников Тогда
		ВыбираемыеПоля.Добавить("ЗаявкаНаПодборПерсонала.ДействияСотрудников.ДействиеСотрудника");
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ДанныеЗаявки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
	Если ПараметрыПолучения.Согласование Тогда
		ДанныеЗаявки.Вставить("Согласование", СогласованиеВакансий.ДанныеСогласования(ЗаявкаНаПодборПерсонала));
	КонецЕсли;
	
	Возврат ДанныеЗаявки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
